#lang scribble/report

@require{../../literacy.rkt}

@(require "../../discipline/big-bang/lesson/agent.rkt")

@;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
@handbook-portfolio-story{智能体与环境}

@lesson-desc[
 #:topic ['big-bang 'agent]
 #:class 'pioneer
]

@handbook-lesson{反射弧}

@period-desc[
 #:goals agent-goals 
 #:datetime ["2024-01-31" "10:00" "11:30"]]

新主题第一次课，开始做第一个游戏程序，
同时也会引入人工智能中的一些概念，
为后续课程做铺垫。

本主题从生物学角度进入：
认识人的大脑和中枢神经系统。
这部分内容原本是义务教育科学五年级的一个章节，
因此，小学生理解它不应该有问题。

在之前的课程中，
我们已经花了大力气分别从语言和数学两个角度理解@tech{函数}，
这节课回归到程序语言里最典型的@tech{函数}视角:
@tech{输入-处理-输出}模型。

在线下课，
这部分内容是通过角色扮演这样的互动游戏来玩的。
线上课没有这个条件，
但是线上课的优点是可以录视频反复看。

每次进入一个大主题，
我都会发给学生与之相关的 docx 文件，
这个是“学生手册”，
相当于配套教材，
里面列出了本主题的学习目标、知识点
和学习流程。
正常情况下，本主题课程学完之后，
学生手册里的内容都应该做完了才对，
并且需要学生课后自行安排时间复习。

无论线上还是线下，
小学生学编程都有很多硬核难题需要解决。
其中最需要重视的是花在编程上的时间，
编程是很专业的课程，
大学生中的初学者都未必能适应，
每周只靠跟老师接触的时间是肯定学不好的。
详细说明请参考附录的@seclink["parent-how-to"]{《家长如何帮助孩子学编程》}。

@handbook-reference[]
