#lang racket/base

(provide (all-defined-out))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(define agent-goals
  (hasheq 20231231
          (hasheq 0855
                  (list "了解大脑的基本功能"
                        "了解中枢神经系统"
                        "理解神经传导的反射弧"))

          20240106
          (hasheq 1415
                  (list "了解大脑的基本功能"
                        "了解中枢神经系统"
                        "理解神经传导的反射弧"))

          20240107
          (hasheq 1015
                  (list "将反射弧简化为“输入-处理-输出”过程"
                        "理解函数的输入、输出和处理"))))
