#lang racket/base

(provide (all-defined-out))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(define agent-goals
  (hasheq 20231231
          (hasheq 0855
                  (list "了解大脑的基本功能"
                        "了解中枢神经系统"
                        "理解神经传导的反射弧"))

          20240106
          (hasheq 1445
                  (list "了解大脑的基本功能"
                        "了解中枢神经系统"
                        "理解神经传导的反射弧"))

          20240107
          (hasheq 1015
                  (list "将反射弧简化为“输入-处理-输出”过程"
                        "理解函数的输入、输出和处理"))

          20240114
          (hasheq 0855
                  (list "了解“名字空间”"
                        "了解C++源码的结构和写作风格"))

          20240127
          (hasheq 1445
                  (list "理解屏幕坐标系与数学坐标系的差别"
                        "了解课程源码C++项目的结构"))
          
          20240128
          (hasheq 0855
                  (list "了解浮点数类型(float)"
                        "知道浮点数有精度问题"
                        "知道整数类型(int)可以自动提升为浮点数类型"
                        "从输入-处理-输出的角度完成对圆面积的计算程序"
                        "了解 printf 函数"))))
