#lang racket

(provide (all-defined-out))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(define big-bang-goals
  (hasheq 20231028
          (hasheq 1445
                  (list "了解“游戏的本质是由数学定义的虚拟世界”"
                        "了解模块化和树形图"
                        "尝试将“舞台”定义成 Python 类"))

          20231104
          (hasheq 1445
                  (list "同步代码"
                        "理解直角坐标系"
                        "理解线段、长方形、圆、椭圆的数学定义和表示方法"))
          
          20231105
          (hasheq 0900
                  (list "了解“游戏的本质是由数学定义的虚拟世界”"
                        "了解模块化和树形图"
                        "尝试将“舞台”定义成类"
                        "理解点、线段、矩形的数学定义和表示方法"))

          20231111
          (hasheq 1445
                  (list "认识正多边形的数学定义和表示方法"
                        "理解锚点和宽高百分比"
                        "理解基本几何变换"))
          
          20231112
          (hasheq 0900
                  (list "更新开发软件和第三方软件库"
                        "理解圆、椭圆的数学定义和表示方法"
                        "了解对偶和有序对"
                        "认识正多边形的数学定义和表示方法"))

          20231119
          (hasheq 0900
                  (list "了解等号(=)的三重理解"
                        "了解“继承”关系"
                        "熟悉课程软件的启动程序"))

          20231125
          (hasheq 1445
                  (list "理解课程软件的结构"
                        "分解复杂图形"
                        "了解 C++ 头文件"))
          
          20231126
          (hasheq 0850
                  (list "重新理清楚基本几何图形的代数符号"
                        "编写 ShapeWorld 头文件")
                  
                  1300
                  (list "了解“游戏的本质是由数学定义的虚拟世界”"
                        "了解模块化和树形图"
                        "熟悉课程软件的启动程序"))

          
          20231202
          (hasheq 1445
                  (list "完成 ShapeWorld 模块文件"))

          20231203
          (hasheq 0845
                  (list "了解字母在代数中的两种基本用法"
                        "理解数学函数可以表达变量之间的变化关系"
                        "了解代数视角的“函数调用”")
                  
                  1300
                  (list "同步课程源码"
                        "规划学生作品的文件结构"
                        "复刻和理解 ShapeWorld 头文件"))

          20231209
          (hasheq 1445
                  (list "理解 ShapeWorld.cpp"
                        "探索创建基本图形的参数"
                        "探索图形组合的对齐锚点"))
          
          20231210
          (hasheq 0900
                  (list "理解创建基本图形的参数"
                        "理解图形组合的对齐锚点"
                        "去大厅作报告介绍自己对 ShapeWorld 的理解"))

          20231216
          (hasheq 1445
                  (list "理解等号(=)的三重思维"
                        "理解字母在数学语言中的基本用法"
                        "理解函数是一种表达变化关系的数学语言"))
          
          20231217
          (hasheq 0850
                  (list "认识 bool 类型"
                        "应用布尔类型求解日常生活的问题"
                        "了解布尔类型与二进制的数学关系"))))
