#lang racket

(provide (all-defined-out))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(define big-bang-goals
  (hasheq 20231028
          (hasheq 1445
                  (list "了解“游戏的本质是由数学定义的虚拟世界”"
                        "了解模块化和树形图"
                        "尝试将“舞台”定义成 Python 类"))

          20231104
          (hasheq 1445
                  (list "同步代码"
                        "理解直角坐标系"
                        "理解线段、长方形、圆、椭圆的数学定义和表示方法"))
          
          20231105
          (hasheq 0900
                  (list "了解“游戏的本质是由数学定义的虚拟世界”"
                        "了解模块化和树形图"
                        "尝试将“舞台”定义成类"
                        "理解点、线段、矩形的数学定义和表示方法"))

          20231111
          (hasheq 1445
                  (list "认识正多边形的数学定义和表示方法"
                        "理解锚点和宽高百分比"
                        "理解基本几何变换"))
          
          20231112
          (hasheq 0900
                  (list "更新开发软件和第三方软件库"
                        "理解圆、椭圆的数学定义和表示方法"
                        "了解对偶和有序对"
                        "认识正多边形的数学定义和表示方法"))

          20231119
          (hasheq 0900
                  (list "了解等号(=)的三重理解"
                        "了解“继承”关系"
                        "熟悉课程软件的启动程序"))))
