#lang racket

(provide (all-defined-out))

(require scribble/manual)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(define function-object-goals
  (hasheq 20230916
          (hasheq 1445
                  (list "安装、配置 Python 开发环境"
                        "复习常用 PowerShell 命令，新学 where.exe"))

          20230923
          (hasheq 1445
                  (list "认识 Python 函数的定义、实现和调用"
                        "利用内存教具模拟函数的调用过程"))

          20231006
          (hasheq 0845
                  (list "初次了解 Racket 语言，借此体验“类型系统”如何确保代码正确"
                        (list "再谈“踢猫效应”，设计舞台剧角色，引入" (tech "类") "和" (tech "对象"))))

          20231014
          (hasheq 1445
                  (list "导演舞台剧“踢猫效应”，设计角色的属性和动作"
                        "抽象设计的舞台剧角色"
                        "将抽象角色翻译成 Python 类代码"))
          
          20231015
          (hasheq 0845
                  (list "设计“踢猫效应”中角色的属性和动作"
                        "抽象设计的舞台剧角色"
                        "将抽象角色翻译成 C++ 类代码")

                  1015
                  (list "导演舞台剧“踢猫效应”，设计角色的属性和动作"
                        "抽象设计的舞台剧角色"
                        "将抽象角色翻译成 Python 类代码")

                  1330
                  (list "安装 C++ 开发工具"
                        "用中文描述“踢猫效应”现象并提取关键字"
                        "将“踢猫效应”翻译成 Python 代码，理解函数的定义、实现和调用"
                        (list "再谈“踢猫效应”，设计舞台剧角色，引入" (tech "类") "和" (tech "对象"))
                        "将角色翻译成 Python 类")

                  1515
                  (list "了解计算机语言、计算机程序等基本概念"
                        "了解 Shell 是一种为专业人士准备的操作计算机的方式"
                        "实际使用 cd, ls, mkdir 等命令建立个人工作目录"
                        "借用“踢猫效应”现象理解 Python 函数的定义和调用"))))
